In [1]:
import pandas as pd 
import numpy as np

## Handling mixed Values

In [3]:
df = pd.read_csv("Dataset/titanic.csv")
df.sample(5)

    Cabin  Ticket number  Survived
223   NaN  349234      A         0
496   D20   36947      A         1
815  B102  112058      4         0
207   NaN    2699      5         1
869   NaN  347742      4         1

In [11]:
df['number'].value_counts()

number
A    139
6    131
1    129
2    126
4    126
5    123
3    117
Name: count, dtype: int64

In [18]:
df['number_numerical'] = pd.to_numeric(df['number'] , errors="coerce" , downcast= "integer")
df['number_catrgorical'] = np.where(df['number_numerical'].isnull() , df['number'] , np.nan)

In [19]:
df.sample(5)

,Cabin,Ticket,number,Survived,number_numerical,number_catrgorical
491,NaN,SOTON/OQ 3101317,6,0,6.0,NaN
277,NaN,239853,4,0,4.0,NaN
25,NaN,347077,3,1,3.0,NaN
691,NaN,349256,3,1,3.0,NaN
459,NaN,371060,3,0,3.0,NaN

In [22]:
df['cabin_num']  = df['Cabin'].str.extract("(\d+)")
df['cabin_cat'] = df['Cabin'].str[0]

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\singh\AppData\Local\Temp\ipykernel_10804\2398669772.py:1: SyntaxWarning: invalid escape sequence '\d'
  df['cabin_num']  = df['Cabin'].str.extract("(\d+)")

In [23]:
df.sample(10)

,Cabin,Ticket,number,Survived,number_numerical,number_catrgorical,cabin_num,cabin_cat
325,C32,PC 17760,6,1,6.0,NaN,32,C
55,C52,19947,6,1,6.0,NaN,52,C
805,NaN,347063,1,0,1.0,NaN,NaN,NaN
577,E44,13507,5,1,5.0,NaN,44,E
632,B50,13214,5,1,5.0,NaN,50,B
388,NaN,367655,6,0,6.0,NaN,NaN,NaN
157,NaN,SOTON/OQ 392090,1,0,1.0,NaN,NaN,NaN
394,G6,PP 9549,6,1,6.0,NaN,6,G
803,NaN,2625,4,1,4.0,NaN,NaN,NaN
589,NaN,A./5. 3235,1,0,1.0,NaN,NaN,NaN

In [25]:
df['cabin_cat'].value_counts()

cabin_cat
C    59
B    47
D    33
E    32
A    15
F    13
G     4
T     1
Name: count, dtype: int64

In [ ]:
df['Ticket'].value_counts()

681

In [38]:
# tickes
df['tick_num'] = pd.to_numeric(df['Ticket'] , errors="coerce" , downcast="integer")
df['tick_cat'] = df['Ticket'].apply(lambda x : x.split(" ")[0])
df['tick_cat'] = np.where(df['tick_cat'].str.isdigit() , np.nan , df['tick_cat'])

In [39]:
df.sample(10)

,Cabin,Ticket,number,Survived,number_numerical,number_catrgorical,cabin_num,cabin_cat,tick_num,tick_cat
642,NaN,347088,A,0,NaN,A,NaN,NaN,347088.0,NaN
95,NaN,374910,6,0,6.0,NaN,NaN,NaN,374910.0,NaN
151,C2,113776,A,1,NaN,A,2,C,113776.0,NaN
407,NaN,29106,A,1,NaN,A,NaN,NaN,29106.0,NaN
539,B39,13568,3,1,3.0,NaN,39,B,13568.0,NaN
521,NaN,349252,5,0,5.0,NaN,NaN,NaN,349252.0,NaN
808,NaN,248723,6,0,6.0,NaN,NaN,NaN,248723.0,NaN
595,NaN,345773,A,0,NaN,A,NaN,NaN,345773.0,NaN
324,NaN,CA. 2343,1,0,1.0,NaN,NaN,NaN,NaN,CA.
640,NaN,350050,5,0,5.0,NaN,NaN,NaN,350050.0,NaN

## Working with Dates and time